# IFCFileWriteOptions Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCFileWriteOptions Properties
IFCFileWriteOptions Class See Also
---
The IFCFileWriteOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FileFormat | The file format of the IFC file. |
| FileName | The full file name of the IFC file to be written. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
IFCFileWriteOptions Class
Autodesk.Revit.DB.IFC Namespace